cron = require('cron').CronJob
random = require('hubot').Response::random
module.exports = (robot) ->
  new cron
    cronTime: "0 30 18 * * 1-5"
    start: true
    timeZone: "Asia/Tokyo"
    onTick: ->
      sayArr = [
        '定時退社の時間になりました。毎日遅くまでご苦労様です。今日ぐらいは早く帰ってもいいんじゃないですか。'
        '定時退社の時間になりました。早く帰ってゆっくりお風呂に入れば疲れもとれますよ。'
        '定時退社の時間になりました。今日のドラマを楽しみにしてたんじゃないですか？'
        '定時退社の時間になりました。家であなたの帰りを待ってる人が居ますよ。'
        '定時退社の時間になりました。役職のある人から早く帰りましょう。'
        '定時退社の時間になりました。今日は用事があるのでお先に失礼します。'
        '定時退社の時間になりました。残業のし過ぎは生産効率の低下を招きます。'
        # '定時退社の時間になりました。貴様ら、とっととお帰りください。'
        # '定時退社の時間になりました。え、まだ働くんですか？社畜さんチーッス。'
        '定時退社の時間になりました。おい、飲みに行かないか。'
        '定時退社の時間になりました。ここは俺に任せてお前らは早く逃げろ！'
        # '定時退社の時間になりました。退社、退社、さっさと退社、しばくぞ♪'
        '定時退社の時間になりました。process.exit();'
      ]
      say = random sayArr
      robot.send { message: { data: {room_id: process.env.ROOM_ID}}}, say
